Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD11_DFP/2.6.76/edc/ATSAMD11D14AS.PIC
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="APBBMASK" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:por="00000000000000000000000001111111" edc:mclr="00000000000000000000000001111111" edc:impl="0x7F" edc:_addr="0x4000041C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PAC1_" edc:nzwidth="0x1" edc:desc="PAC1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="HMATRIX_" edc:nzwidth="0x1" edc:desc="HMATRIX APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="APBCMASK" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000100000000" edc:mclr="00000000000000000000000100000000" edc:impl="0xFFF" edc:_addr="0x40000420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PAC2_" edc:nzwidth="0x1" edc:desc="PAC2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:nzwidth="0x1" edc:desc="TCC0 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:nzwidth="0x1" edc:desc="ADC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:nzwidth="0x1" edc:desc="PTC APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40000424"/>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40000434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:nzwidth="0x1" edc:desc="Clock Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CFD" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40000435">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:nzwidth="0x1" edc:desc="Clock Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CFD" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40000436">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:nzwidth="0x1" edc:desc="Clock Ready"/>
            <edc:SFRFieldDef edc:cname="CFD" edc:nzwidth="0x1" edc:desc="Clock Failure Detector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x40000437"/>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="RCAUSE" edc:nzwidth="0x8" edc:access="-rrr-rrr" edc:por="00000001" edc:mclr="00000001" edc:impl="0x77" edc:_addr="0x40000438">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="POR" edc:nzwidth="0x1" edc:desc="Power On Reset"/>
            <edc:SFRFieldDef edc:cname="BOD12" edc:nzwidth="0x1" edc:desc="Brown Out 12 Detector Reset"/>
            <edc:SFRFieldDef edc:cname="BOD33" edc:nzwidth="0x1" edc:desc="Brown Out 33 Detector Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:nzwidth="0x1" edc:desc="External Reset"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:nzwidth="0x1" edc:desc="Watchdog Reset"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:nzwidth="0x1" edc:desc="System Reset Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C7" edc:_addr="0x40000439"/>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="--------------nnn---nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x38FFF" edc:_addr="0x40000800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:nzwidth="0x1" edc:desc="OSC32K Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OSC8MRDY" edc:nzwidth="0x1" edc:desc="OSC8M Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Lock Timeout Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
